Data Cleaning and Manipulation

In [11]:
import pandas as pd
food_df = pd.read_csv('datasets/food.csv')
menu_df = pd.read_csv('datasets/menu.csv')
orders_df = pd.read_csv('datasets/orders.csv')
restaurant_df = pd.read_csv('datasets/restaurant.csv')
users_df = pd.read_csv('datasets/users.csv')

/var/folders/8h/hbj9kb412sz4vmszf826vrrc0000gn/T/ipykernel_59379/159337376.py:3: DtypeWarning: Columns (5) have mixed types. Specify dtype option on import or set low_memory=False.
  menu_df = pd.read_csv('datasets/menu.csv')

In [12]:
food_df.isnull().sum()

Unnamed: 0        0
f_id              0
item              1
veg_or_non_veg    1
dtype: int64

In [13]:
food_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 371561 entries, 0 to 371560
Data columns (total 4 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   Unnamed: 0      371561 non-null  int64
 1   f_id            371561 non-null  object
 2   item            371560 non-null  object
 3   veg_or_non_veg  371560 non-null  object
dtypes: int64(1), object(3)
memory usage: 11.3+ MB

In [14]:
food_df.dropna(inplace=True)

In [15]:
food_df = food_df.drop(columns=['Unnamed: 0'])

In [16]:
food_df.to_csv('cleaned_food.csv', index=False)

In [18]:
food_df.columns

Index(['f_id', 'item', 'veg_or_non_veg'], dtype='object')

In [17]:
food_df.head()

  f_id                  item veg_or_non_veg
0  fd0     Aloo Tikki Burger            Veg
1  fd1     Veg Creamy Burger            Veg
2  fd2   Cheese Burst Burger            Veg
3  fd3  Paneer Creamy Burger            Veg
4  fd4        Maxican Burger            Veg

In [10]:
restaurant_df.isnull().sum()

Unnamed: 0        0
id                0
name             86
city              0
rating           86
rating_count     86
cost            131
cuisine          99
lic_no          229
link              0
address          86
menu              0
dtype: int64

In [20]:
restaurant_df_updated = restaurant_df.drop(['Unnamed: 0','lic_no', 'link', 'menu', 'address'], axis=1)

In [24]:
restaurant_df_updated.isnull().sum()

id                0
name             86
city              0
rating           86
rating_count     86
cost            131
cuisine          99
dtype: int64

In [25]:
restaurant_df_updated.dropna(inplace=True)

In [26]:
restaurant_df_updated.columns

Index(['id', 'name', 'city', 'rating', 'rating_count', 'cost', 'cuisine'], dtype='object')

In [27]:
restaurant_df_updated.info()

<class 'pandas.core.frame.DataFrame'>
Index: 148398 entries, 0 to 148540
Data columns (total 7 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   id            148398 non-null  int64
 1   name          148398 non-null  object
 2   city          148398 non-null  object
 3   rating        148398 non-null  object
 4   rating_count  148398 non-null  object
 5   cost          148398 non-null  object
 6   cuisine       148398 non-null  object
dtypes: int64(1), object(6)
memory usage: 9.1+ MB

In [28]:
restaurant_df_updated.head()

,id,name,city,rating,rating_count,cost,cuisine
0,567335,AB FOODS POINT,Abohar,--,Too Few Ratings,₹ 200,"Beverages,Pizzas"
1,531342,Janta Sweet House,Abohar,4.4,50+ ratings,₹ 200,"Sweets,Bakery"
2,158203,theka coffee desi,Abohar,3.8,100+ ratings,₹ 100,Beverages
3,187912,Singh Hut,Abohar,3.7,20+ ratings,₹ 250,"Fast Food,Indian"
4,543530,GRILL MASTERS,Abohar,--,Too Few Ratings,₹ 250,"Italian-American,Fast Food"

In [29]:
restaurant_df_updated['rating'].unique()

array(['--', '4.4', '3.8', '3.7', '3.6', '4.0', '4.2', '4.7', '4.1',
       '3.5', '3.1', '3.4', '3.3', '4.8', '3.9', '2.7', '4.3', '2.9',
       '4.5', '2.5', '3.2', '2.4', '4.6', '3.0', '2.8', '2.3', '5.0',
       '2.6', '2.2', '1.4', '1.9', '4.9', '2.1', '1.3', '2.0', '1.8',
       '1.6', '1.1', '1.5', '1.0', '1.2', '1.7'], dtype=object)

The code below shows how to change the values in the `rating` column to floats. If there are any missing values like `"--"`, they will be replaced with `-1`

In [30]:
restaurant_df_updated['rating'] = restaurant_df_updated['rating'].replace('--', -1)
restaurant_df_updated['rating'] = restaurant_df_updated['rating'].astype(float)

Convert `cost` to Integer and Remove Original Column

In [31]:
restaurant_df_updated['avg_cost_for_a_meal'] = restaurant_df_updated['cost'].str.replace('₹ ', '').astype(int)
restaurant_df_updated = restaurant_df_updated.drop('cost', axis=1)

In [32]:
print(restaurant_df_updated['cuisine'].unique())

['Beverages,Pizzas' 'Sweets,Bakery' 'Beverages' ... 'Biryani,Thai'
 'South American,Andhra' 'Barbecue,Italian-American']

Split the `cuisine` column into two new columns. 
n=1: Limits the split to the first occurrence of the delimiter, resulting in up to two parts.
expand=True: Expands the result into separate columns.

In [33]:
restaurant_df_updated[['cuisine_1', 'cuisine_2']] = restaurant_df_updated['cuisine'].str.split(',', n=1, expand=True)
restaurant_df_updated = restaurant_df_updated.drop('cuisine', axis=1)

Check for rows where `cuisine_2` column contains a comma(more than one cusine)

In [34]:
rows_with_commas = restaurant_df_updated[restaurant_df_updated['cuisine_2'].str.contains(',', na=False)]
print("Rows with commas in 'cuisine_2':")
print(rows_with_commas)

Rows with commas in 'cuisine_2':
Empty DataFrame
Columns: [id, name, city, rating, rating_count, avg_cost_for_a_meal, cuisine_1, cuisine_2]
Index: []

In [35]:
restaurant_df_updated['city'].unique()

array(['Abohar', 'Adilabad', 'Adityapur', 'Adoni', 'Agartala', 'Agra',
       'Vastrapur,Ahmedabad', 'GOTA,Ahmedabad',
       'Paldi & Ambawadi,Ahmedabad', 'Ghatlodia,Ahmedabad',
       'Bopal,Ahmedabad', 'Gandhinagar,Ahmedabad', 'LalDarwaja,Ahmedabad',
       'Naranpura,Ahmedabad', 'Navrangpura,Ahmedabad',
       'Science City,Ahmedabad', 'Maninagar,Ahmedabad',
       'Chandkheda,Ahmedabad', 'Ahmednagar', 'Aizawl', 'Ajmer', 'Akola',
       'Alappuzha', 'Aligarh', 'Alipurduar', 'Allahabad', 'Alwar',
       'Ambala', 'Ambikapur', 'Ambur', 'Amravati', 'Amreli', 'Amritsar',
       'Anand', 'Anantapur', 'Ankleshwar', 'Arakkonam', 'Arambagh',
       'Arrah', 'Aruppukottai', 'Asansol', 'Aurangabad',
       'Aurangabad_bihar', 'Azamgarh', 'Baddi', 'Bagalkot', 'Bagdogra',
       'Bahadurgarh', 'Bahraich', 'Balaghat', 'Balangir', 'Balasore',
       'Ballari', 'Balrampur', 'Balurghat', 'Banda',
       'Yeshwanthpur,Bangalore', 'Geddalahalli,Bangalore',
       'Koramangala,Bangalore', 'JP Nagar,Bangalore',
       'Mahadevpura,Bangalore', 'HSR,Bangalore', 'Arekere,Bangalore',
       'Indiranagar,Bangalore', 'Banashankari,Bangalore',
       'Whitefield,Bangalore', 'Nagavara & Hennur,Bangalore',
       'Kammanahalli/Kalyan Nagar,Bangalore',
       'Kumaraswamy Layout & Uttarahalli,Bangalore', 'BTM,Bangalore',
       'Battarahalli,Bangalore', 'Basaveshwaranagar,Bangalore',
       'Frazer Town,Bangalore', 'Sanjay Nagar, New BEL Road,Bangalore',
       'Yelahanka,Bangalore', 'Majestic,Bangalore',
       'Kanakapura Road,Bangalore', 'R.T. Nagar,Bangalore',
       'Kadugodi,Bangalore', 'Marathahalli,Bangalore',
       'Rajarajeshwari Nagar,Bangalore', 'CV Raman Nagar,Bangalore',
       'Electronic City,Bangalore', 'Rajajinagar,Bangalore',
       'Kadubeesanahalli,Bangalore', 'Shantinagar,Bangalore',
       'Jayanagar,Bangalore', 'Central Bangalore,Bangalore', 'Bantwal',
       'Bapatlachirala', 'Baramati', 'Baran', 'Bardhaman', 'Bardoli',
       'Bareilly', 'Barmer', 'Barnala', 'Barshi', 'Barwani', 'Basirhat',
       'Basti', 'Batala', 'Bathinda', 'Beawar', 'Beed', 'Begusarai',
       'Bela-pratapgarh', 'Belgaum', 'Berhampore', 'Berhampur', 'Bettiah',
       'Betul', 'Bhadohi', 'Bhadrachalam', 'Bhagalpur', 'Bhandara',
       'Bharabanki', 'Bharatpur', 'Bharuch', 'Bhatkal', 'Bhavnagar',
       'Bhawanipatna', 'Bhilai', 'Bhilwara', 'Bhimavaram', 'Bhind',
       'Bhiwadi', 'Bhiwani', 'Bhopal', 'Bhubaneswar', 'Bhuj', 'Bhusawal',
       'Bidar', 'Biharsharif', 'Bijapur', 'Bijnor', 'Bikaner', 'Bilaspur',
       'Bilimora', 'Bodhan-rural', 'Bodinayakanur', 'Boisar', 'Bokaro',
       'Bolpur', 'Bongaigaon', 'Bongaon', 'Budaun', 'Budhwal',
       'Bulandshahr', 'Buldana', 'Bundi', 'Burhanpur', 'Buxar',
       'Central-goa', 'Chakdaha', 'Chalakkudy', 'Chalisgaon', 'Chandausi',
       'Greater Mohali,Chandigarh', 'Zirakpur,Chandigarh',
       'East Chd,Chandigarh', 'North Mohali,Chandigarh',
       'South Mohali,Chandigarh', 'West Chd,Chandigarh',
       'Panchkula,Chandigarh', 'South Chd,Chandigarh', 'Chandrapur',
       'Changanassery', 'Chengannur', 'Poonamallee,Chennai',
       'OMR Navalur,Chennai', 'Mylapore,Chennai', 'Guindy,Chennai',
       'Annanagar,Chennai', 'Chrompet,Chennai', 'Urapakkam,Chennai',
       'George Town,Chennai', 'KK Nagar,Chennai', 'OMR Perungudi,Chennai',
       'Kilpauk,Chennai', 'Vadapalani,Chennai', 'Perambur,Chennai',
       'Royapettah,Chennai', 'Tambaram,Chennai', 'Padur,Chennai',
       'Velachery,Chennai', 'Nungambakkam,Chennai', 'Avadi,Chennai',
       'Porur,Chennai', 'Ramapuram,Chennai', 'Perumbakkam,Chennai',
       'ECR-Kottivakkam,Chennai', 'Egmore,Chennai', 'Arumbakkam,Chennai',
       'Madipakkam,Chennai', 'Ambattur,Chennai',
       'Mahindra World City,Chennai', 'Alwarpet,Chennai',
       'Mogappair,Chennai', 'Iyyapanthangal,Chennai',
       'Medavakkam,Chennai', 'Villivakkam,Chennai', 'Karappakam,Chennai',
       'Royapuram,Chennai', 'Adyar,Chennai', 'T Nagar,Chennai',
       'Purasawalkam,Chennai', 'Cherthala', 'Chhapra', 'Chhatarpur',
       'Chhindwara', 'Chidambaram', 'Chikhli', 'Chikkaballapur',
       'Chikmagalur', 'Chiplun', 'Chitradurga', 'Chittoor', 'Chittorgarh',
       'Chopda', 'Churu', 'Peelamedu,Coimbatore', 'Hopes,Coimbatore',
       'Race Course,Coimbatore', 'Sai Baba Colony,Coimbatore',
       'Gandhipuram,Coimbatore', 'Saravanampatti,Coimbatore',
       'Ramanathapuram,Coimbatore', 'Coi_Ganapathy,Coimbatore',
       'Cooch-behar', 'Cuddalore', 'Cuttack', 'Dahanu', 'Dahod', 'Daman',
       'Darbhanga', 'Darjeeling', 'Dausa', 'Davanagere',
       'Chukkuwala,Dehradun', 'Hathibarkala,Dehradun',
       'Race Course Dehradun,Dehradun', 'Jakhan,Dehradun', 'Dehri',
       'GTB Nagar,Delhi', 'Jasola,Delhi', 'Greater Noida,Delhi',
       'Mayur Vihar,Delhi', 'BBK_MayurVihar,Delhi', 'Laxmi Nagar,Delhi',
       'Punjabi Bagh,Delhi', 'Old Delhi,Delhi', 'Khan Market,Delhi',
       'Greater Kailash 2,Delhi', 'Ashok Vihar,Delhi',
       'Noida Expressway,Delhi', 'South Extension,Delhi',
       'Greater Kailash New,Delhi', 'Vasant Kunj,Delhi',
       'Uttam Nagar,Delhi', 'Dilshad Gardens,Delhi',
       'Connaught Place,Delhi', 'South Campus,Delhi', 'Rohini,Delhi',
       'BBK_Chattarpur,Delhi', 'Chattarpur,Delhi', 'Lajpat Nagar,Delhi',
       'Kirti Nagar,Delhi', 'Indirapuram,Delhi', 'Dwarka,Delhi',
       'Rajouri Garden,Delhi', 'NSP,Delhi', 'Malviya Nagar,Delhi',
       'Sector 18,Delhi', 'Deoghar', 'Dewas', 'Dhanbad', 'Dhar',
       'Dharamshala', 'Dharmapuri', 'Dharwad', 'Dhoraji', 'Dhule',
       'Dibrugarh', 'Dimapur', 'Dindigul', 'Diu', 'Doddaballapura',
       'Duliajan', 'Dumka', 'Durgapur', 'Eluru', 'Erode', 'Etawah',
       'Faizabad', 'Faridabad', 'Faridkot', 'Farrukhabad', 'Fatehabad',
       'Fatehgarh-sahib', 'Fatehpur', 'Fazilka', 'Firozabad', 'Firozpur',
       'Gadag-betigeri', 'Gadwal', 'Gandhidham', 'Gangapur-city',
       'Gangtok', 'Gauriganj', 'Gaya', 'Giridih', 'Godhra', 'Gokak',
       'Golaghat', 'Gonda', 'Gondal', 'Gondia', 'Gopalganj', 'Gorakhpur',
       'Gudivada', 'Guna', 'Guntakal', 'Guntur', 'Gurdaspur',
       'Greenfields_FBD,Gurgaon', 'Sector-14,Gurgaon',
       'Sector 15_FBD,Gurgaon', 'New DLF Phase 4,Gurgaon',
       'NIT_FBD,Gurgaon', 'New Sohna Road,Gurgaon',
       'Old Gurgaon (Zone 6),Gurgaon', 'sohna road,Gurgaon',
       'New Cyber City,Gurgaon', 'Paltan Bazaar,Guwahati',
       'Ganeshguri,Guwahati', 'Gwalior', 'Habra', 'Haldia', 'Haldwani',
       'Halol', 'Hampi', 'Hansi', 'Hanumangarh', 'Hapur', 'Hardoi',
       'Haridwar', 'Hassan', 'Himmatnagar', 'Hindaun', 'Hinganghat',
       'Hisar', 'Hoshangabad', 'Hoshiarpur', 'Hospet', 'Hubli',
       'Kompally,Hyderabad', 'Himayath Nagar,Hyderabad',
       'Jubilee Hills,Hyderabad', 'Kachiguda,Hyderabad',
       'Begumpet,Hyderabad', 'Kothapet & Dilsukhnagar,Hyderabad',
       'Lingampally & Nalagandla,Hyderabad', 'Balanagar & Idpl,Hyderabad',
       'Kondapur,Hyderabad', 'Ameerpet,Hyderabad',
       'Abids & Koti,Hyderabad', 'Banjara Hills,Hyderabad',
       'Gachibowli,Hyderabad', 'Suncity & Bandlaguda,Hyderabad',
       'Vanasthalipuram,Hyderabad', 'Nampally,Hyderabad',
       'Miyapur,Hyderabad', 'Manikonda,Hyderabad', 'Madhapur,Hyderabad',
       'Mehdipatnam,Hyderabad', 'Kharkhana & Trimulgherry,Hyderabad',
       'West Marredpally,Hyderabad',
       'Tarnaka, Nacharam & Malkajigiri,Hyderabad',
       'Santoshnagar & Saidabad,Hyderabad', 'Alwal,Hyderabad',
       'Padmarao Nagar,Hyderabad', 'Kukatpally,Hyderabad',
       'Nizampet & Pragathi Nagar,Hyderabad', 'Tolichowki,Hyderabad',
       'Nanakramguda,Hyderabad', 'Attapur,Hyderabad', 'Ichalkaranji',
       'Imphal', 'Sarafa,Indore', 'Vijay Nagar,Indore',
       'South Tukoganj,Indore', 'Bhawar Kuan,Indore',
       'Old Palasia,Indore', 'New Palasia,Indore', 'Irinjalakuda',
       'Itanagar', 'Itarsi', 'Jabalpur', 'Jagdalpur', 'Jagraon',
       'Jagtial', 'Jahanabad', 'Manasarovar,Jaipur', 'Jalaun', 'Jalgaon',
       'Jalpaiguri', 'Jammu', 'Jamnagar', 'Jamshedpur', 'Jaunpur',
       'Jhalawar', 'Jhansi', 'Jhargram', 'Jhunjhunu', 'Jind', 'Jodhpur',
       'Jorhat', 'Junagadh', 'Kadapa', 'Kadayanallur', 'Kadiri',
       'Kaithal', 'Kakinada', 'Kalaburagi', 'Kalady', 'Kamareddy',
       'Kanchrapara', 'Kannauj', 'Kannur', 'Kanpur', 'Kanyakumari',
       'Kapurthala', 'Karad', 'Karaikkudi', 'Karimnagar', 'Karnal',
       'Karunagappaly', 'Karur', 'Karwar', 'Kasaragod', 'Kashipur',
       'Katihar', 'Katni', 'Kavali', 'Kayamkulam', 'Kendujhar',
       'Khamgaon', 'Khammam', 'Khandwa', 'Khanna', 'Kharagpur',
       'Kishanganj', 'Kishangarh', 'Vyttila,Kochi', 'Kalamassery,Kochi',
       'Aluva,Kochi', 'Panampilly Nagar,Kochi', 'Lulu Mall,Kochi',
       'Fort Kochi,Kochi', 'Thrippunithura,Kochi', 'Kodaikanal', 'Kohima',
       'Kolar', 'Kolhapur', 'Howrah,Kolkata', 'South Kolkata,Kolkata',
       'Rajarhat,Kolkata', 'Burrabazar,Kolkata', 'North Dumdum,Kolkata',
       'Chinar Park,Kolkata', 'Kestopur,Kolkata', 'Kidderpore,Kolkata',
       'Salt Lake,Kolkata', 'Ruby Area,Kolkata', 'Santoshpur,Kolkata',
       'Bally,Kolkata', 'Central Kolkata,Kolkata', 'Garia,Kolkata',
       'Tangra,Kolkata', 'Esplanade,Kolkata', 'Kankurgachi,Kolkata',
       'Naktala,Kolkata', 'Behala,Kolkata', 'Alipore,Kolkata',
       'Lake Town,Kolkata', 'Dumdum,Kolkata', 'Jadavpur,Kolkata',
       'Thakurpukur,Kolkata', 'Hatibagan,Kolkata', 'Kollam', 'Kopargaon',
       'Koppal', 'Korba', 'Kota', 'Kotdwar', 'Kothagudem',
       'Kothamanagalam', 'Kottakkal', 'Kottarakkara', 'Kottayam',
       'Kovilpatti', 'Kozhikode', 'Krishnagiri', 'Krishnanagar',
       'Kumarakom', 'Kumbakonam', 'Kumta', 'Kundapura', 'Kunnamkullam',
       'Kurnool', 'Kurukshetra', 'Lakhimpur', 'Lalitpur', 'Latur',
       'Lonavala', 'Lonavla', 'Gomti Nagar,Lucknow', 'Hazratganj,Lucknow',
       'Bbd,Lucknow', 'Ashiyana,Lucknow', 'Aminabad,Lucknow',
       'Aliganj,Lucknow', 'Alambagh,Lucknow', 'Indira Nagar,Lucknow',
       'Civil Lines,Ludhiana', 'BRS Nagar,Ludhiana',
       'Model Town,Ludhiana', 'Dugri,Ludhiana', 'Machilipatnam',
       'Madanapalle', 'Madhubani', 'Madikeri', 'Madurai', 'Mahbubnagar',
       'Malappuram', 'Malda', 'Malegaon', 'Malout', 'Manali',
       'Mancherial', 'Mandi-dabwali', 'Mandi-gobindgarh', 'Mandsaur',
       'Mandya', 'Mangaluru', 'Manipal', 'Manjeri', 'Mansa', 'Markapur',
       'Mathura', 'Maunath-bhanjan', 'Mayiladuthurai', 'Medinipur',
       'Meerut', 'Mehsana', 'Miryalaguda', 'Mirzapur', 'Modinagar',
       'Moga', 'Moodbidri', 'Moradabad', 'Morbi', 'Morena', 'Motihari',
       'Mount-abu', 'Mughalsarai', 'Muktsar', 'Virar,Mumbai',
       'Powai,Mumbai', 'Kamothe,Mumbai', 'Mulund,Mumbai',
       'Mahalaxmi Malabar Hill,Mumbai', 'Vashi,Mumbai',
       'Bandra West,Mumbai', 'Scruz Bandra East,Mumbai',
       'Fort Colaba,Mumbai', 'Bhayandar,Mumbai', 'Mahim Dadar,Mumbai',
       'Starbucks_BKC,Mumbai', 'Vasai,Mumbai', 'Matunga Wadala,Mumbai',
       'Airoli,Mumbai', 'Munger', 'Murshidabad', 'Mussoorie',
       'Muvattupuzha', 'Muzaffarnagar', 'Muzaffarpur',
       'Mysore North,Mysore', 'Mysore South,Mysore', 'Nabadwip', 'Nadiad',
       'Nagaon', 'Nagapattinam', 'Nagda', 'Nagercoil',
       'Dharampeth,Nagpur', 'Nandanvan,Nagpur', 'Sitabuldi,Nagpur',
       'Gandhibagh,Nagpur', 'Bajaj Nagar,Nagpur', 'Manish Nagar,Nagpur',
       'Sadar,Nagpur', 'Wardha Road,Nagpur', 'Naharlagun', 'Nainital',
       'Nalgonda', 'Namakkal', 'Nanded', 'Nandurbar', 'Nandyal', 'Nangal',
       'Naraingarh', 'Narasaraopet', 'Narnaul', 'Narsinghpur', 'Navsari',
       'Neemuch', 'Nellore', 'Neyveli', 'Nipani', 'Nirmal', 'Nizamabad',
       'Raj Nagar,Noida', 'Noida-1', 'North-goa', 'Ongole', 'Ooty',
       'Orai', 'Osmanabad', 'Pala', 'Palakkad', 'Palampur', 'Palani',
       'Palanpur', 'Pali', 'Panipat', 'Parbhani', 'Pathankot', 'Patiala',
       'Patna', 'Perinthalmanna', 'Phagwara', 'Pilibhit', 'Pondicherry',
       'Porbandar', 'Proddatur', 'Pudukkottai', 'Wanowrie,Pune',
       'Koregaon Park,Pune', 'Hadapsar,Pune', 'Warje,Pune',
       'Pimple Saudagar,Pune', 'Kothrud,Pune', 'Vishrantwadi,Pune',
       'Sangvi,Pune', 'Bibwewadi,Pune', 'Wakad,Pune', 'Kondhwa,Pune',
       'Swargate,Pune', 'Nigdi,Pune', 'Bavdhan,Pune', 'Bhosari,Pune',
       'Sinhgad Road,Pune', 'Wagholi,Pune', 'Narhe,Pune',
       'Hinjewadi,Pune', 'Bopodi,Pune', 'PCMC,Pune', 'Dhankawadi,Pune',
       'Viman Nagar,Pune', 'Aundh,Pune', 'Kalyani Nagar,Pune',
       'Kharadi,Pune', 'Shivaji Nagar,Pune', 'Hinjewadi Phase-3,Pune',
       'Baner,Pune', 'Magarpatta,Pune', 'Puri', 'Purnea', 'Purulia',
       'Pusad', 'Puttur', 'Rae-bareli', 'Raghunathpur', 'Raichur',
       'Raiganj', 'Raigarh', 'Raipur', 'Rajahmundry', 'Rajapalayam',
       'Rajkot', 'Rajnandgaon', 'Rajsamand', 'Ramagundam', 'Ramanagara',
       'Ramanathapuram', 'Rampur', 'Ranaghat-wb', 'Ranchi', 'Rangpo',
       'Ranibennur', 'Raniganj', 'Ratlam', 'Ratnagiri', 'Rayachoty',
       'Rewa', 'Rewari', 'Rishikesh', 'Rohtak', 'Roorkee', 'Ropar',
       'Rourkela', 'Rudrapur', 'Sagar', 'Saharanpur', 'Saharsa', 'Salem',
       'Samastipur', 'Sambalpur', 'Sangamner', 'Sangli', 'Sangrur',
       'Sasaram', 'Satara', 'Satna', 'Sawai-madhopur', 'Sehore',
       'Shahjahanpur', 'Shikohabad', 'Shillong', 'Shimla', 'Shivamogga',
       'Shivpuri', 'Shrirampur', 'Siddipet', 'Sikar', 'Silchar',
       'Siliguri', 'Silvassa', 'Sindhanur', 'Singrauli', 'Sirsa', 'Sirsi',
       'Sitapur', 'Sivakasi', 'Sivasagar', 'Siwan', 'Solan', 'Solapur',
       'Sonipat', 'South-goa', 'Sri-ganganagar', 'Srikakulam',
       'Srivilliputhur', 'Sultanpur', 'Athwa,Surat', 'Adajan,Surat',
       'Piplod,Surat', 'Suratgarh', 'Surendranagar-dudhrej', 'Suryapet',
       'Tadepalligudem', 'Tadpatri', 'Tanuku', 'Tarn-taran-sahib',
       'Tenkasi', 'Tezpur', 'Thalassery', 'Thanjavur', 'Theni',
       'Thiruvalla', 'Thiruvallur', 'Thiruvananthapuram', 'Thiruvarur',
       'Thodupuzha', 'Thoothukudi', 'Thrissur', 'Tinsukia', 'Tiptur',
       'Tirunelveli', 'Tirupati', 'Tirupur', 'Tiruvannamalai', 'Tohana',
       'Trichy', 'Tumakuru', 'Tuni', 'Udaipur', 'Udgir', 'Ujjain',
       'Uluberia', 'Uran-islampur', 'Akota,Vadodara', 'Alkapuri,Vadodara',
       'Vadiwadi,Vadodara', 'Valsad', 'Vapi', 'Varanasi', 'Varkala',
       'Vellore', 'Veraval', 'Vidisha',
       'Benz Circle and Auto Nagar,Vijayawada', 'Governorpet,Vijayawada',
       'Virudhunagar', 'Visnagar', 'N A D,Vizag', 'Gajuwaka,Vizag',
       'Jagadamba Junction,Vizag', 'MVP Colony,Vizag',
       'Dwarka Nagar,Vizag', 'Vizianagaram', 'Vyara', 'Waidhan',
       'Warangal', 'Wardha', 'Washim', 'Yamuna-nagar', 'Yavatmal'],
      dtype=object)

In [36]:
restaurant_df_updated.head()

,id,name,city,rating,rating_count,avg_cost_for_a_meal,cuisine_1,cuisine_2
0,567335,AB FOODS POINT,Abohar,-1.0,Too Few Ratings,200,Beverages,Pizzas
1,531342,Janta Sweet House,Abohar,4.4,50+ ratings,200,Sweets,Bakery
2,158203,theka coffee desi,Abohar,3.8,100+ ratings,100,Beverages,None
3,187912,Singh Hut,Abohar,3.7,20+ ratings,250,Fast Food,Indian
4,543530,GRILL MASTERS,Abohar,-1.0,Too Few Ratings,250,Italian-American,Fast Food

In [37]:
city =  restaurant_df_updated['city'].value_counts(ascending=False)
city

city
Bikaner                 1666
Noida-1                 1427
Indirapuram,Delhi       1279
BTM,Bangalore           1161
Rohini,Delhi            1135
                        ...
Alwarpet,Chennai           1
Naharlagun                 1
Mahim Dadar,Mumbai         1
Starbucks_BKC,Mumbai       1
Rangpo                     1
Name: count, Length: 821, dtype: int64

In [38]:
city_less_than_10 = city[city<10]
def handle_city(value):
    if(value in city_less_than_10):
        return 'others'
    else:
        return value
    
restaurant_df_updated['city'] = restaurant_df_updated['city'].apply(handle_city)
restaurant_df_updated['city'].value_counts()

city
Bikaner              1666
Noida-1              1427
Indirapuram,Delhi    1279
BTM,Bangalore        1161
Rohini,Delhi         1135
                     ...
Gadwal                 11
Lulu Mall,Kochi        11
Kothagudem             10
Mussoorie              10
Barwani                10
Name: count, Length: 775, dtype: int64

In [39]:
restaurant_df_updated.head()

,id,name,city,rating,rating_count,avg_cost_for_a_meal,cuisine_1,cuisine_2
0,567335,AB FOODS POINT,Abohar,-1.0,Too Few Ratings,200,Beverages,Pizzas
1,531342,Janta Sweet House,Abohar,4.4,50+ ratings,200,Sweets,Bakery
2,158203,theka coffee desi,Abohar,3.8,100+ ratings,100,Beverages,None
3,187912,Singh Hut,Abohar,3.7,20+ ratings,250,Fast Food,Indian
4,543530,GRILL MASTERS,Abohar,-1.0,Too Few Ratings,250,Italian-American,Fast Food

In [40]:
restaurant_df_updated.to_csv('cleaned_restaurant_df.csv', index=False)

In [41]:
menu_df.isnull().sum()

Unnamed: 0    0
menu_id       0
r_id          0
f_id          0
cuisine       0
price         0
dtype: int64

In [42]:
menu_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1179936 entries, 0 to 1179935
Data columns (total 6 columns):
 #   Column      Non-Null Count    Dtype
---  ------      --------------    -----
 0   Unnamed: 0  1179936 non-null  int64
 1   menu_id     1179936 non-null  object
 2   r_id        1179936 non-null  int64
 3   f_id        1179936 non-null  object
 4   cuisine     1179936 non-null  object
 5   price       1179936 non-null  object
dtypes: int64(2), object(4)
memory usage: 54.0+ MB

In [113]:
#menu_df_updated = menu_df.drop(['Unnamed: 0'], axis=1)
menu_df_updated = menu_df.rename(columns={'Unnamed: 0': 'id'})

In [114]:
menu_df_updated.head()

   id menu_id    r_id      f_id           cuisine price
0   0     mn0  567335       fd0  Beverages,Pizzas  40.0
1   1     mn0  567335  fd669322  Beverages,Pizzas  40.0
2   2   mn328  158203       fd0         Beverages  65.0
3   3   mn328  158203  fd669322         Beverages  65.0
4   4   mn449  158203       fd0         Beverages  65.0

In [116]:
menu_df_updated.columns

Index(['id', 'menu_id', 'r_id', 'f_id', 'cuisine', 'price'], dtype='object')

In [117]:
menu_df_updated[['cuisine_1', 'cuisine_2']] = menu_df_updated['cuisine'].str.split(',', n=1, expand=True)
menu_df_updated = menu_df_updated.drop('cuisine', axis=1)

In [118]:
menu_df_updated.head()

   id menu_id    r_id      f_id price  cuisine_1 cuisine_2
0   0     mn0  567335       fd0  40.0  Beverages    Pizzas
1   1     mn0  567335  fd669322  40.0  Beverages    Pizzas
2   2   mn328  158203       fd0  65.0  Beverages      None
3   3   mn328  158203  fd669322  65.0  Beverages      None
4   4   mn449  158203       fd0  65.0  Beverages      None

In [119]:
menu_df_updated.isnull().sum()

id                0
menu_id           0
r_id              0
f_id              0
price             0
cuisine_1         0
cuisine_2    241123
dtype: int64

In [120]:
# Convert to numeric, forcing errors to NaN
menu_df_updated['price_numeric'] = pd.to_numeric(menu_df_updated['price'], errors='coerce')

# Identify rows where conversion resulted in NaN
non_convertible = menu_df_updated[menu_df_updated['price_numeric'].isna()]

# Remove rows with NaN values in 'price_numeric'
menu_df_cleaned = menu_df_updated.dropna(subset=['price_numeric'])

# Drop the temporary 'price_numeric' column if no longer needed
menu_df_cleaned = menu_df_cleaned.drop(columns=['price_numeric'])
menu_df_cleaned

              id    menu_id    r_id       f_id  price  cuisine_1 cuisine_2
0              0        mn0  567335        fd0   40.0  Beverages    Pizzas
1              1        mn0  567335   fd669322   40.0  Beverages    Pizzas
2              2      mn328  158203        fd0   65.0  Beverages      None
3              3      mn328  158203   fd669322   65.0  Beverages      None
4              4      mn449  158203        fd0   65.0  Beverages      None
...          ...        ...     ...        ...    ...        ...       ...
1179931  1179931  mn1048555   96525  fd1048555  300.0  Ice Cream  Desserts
1179932  1179932  mn1048556   96525  fd1048556  300.0  Ice Cream  Desserts
1179933  1179933  mn1048558   96525  fd1048558  350.0  Ice Cream  Desserts
1179934  1179934  mn1048561   96525  fd1048561  200.0  Ice Cream  Desserts
1179935  1179935  mn1048562   96525  fd1048562  270.0  Ice Cream  Desserts

[1178743 rows x 7 columns]

In [121]:
menu_df_cleaned.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1178743 entries, 0 to 1179935
Data columns (total 7 columns):
 #   Column     Non-Null Count    Dtype
---  ------     --------------    -----
 0   id         1178743 non-null  int64
 1   menu_id    1178743 non-null  object
 2   r_id       1178743 non-null  int64
 3   f_id       1178743 non-null  object
 4   price      1178743 non-null  object
 5   cuisine_1  1178743 non-null  object
 6   cuisine_2  937985 non-null   object
dtypes: int64(2), object(5)
memory usage: 71.9+ MB

In [122]:
menu_df_cleaned.isnull().sum()

id                0
menu_id           0
r_id              0
f_id              0
price             0
cuisine_1         0
cuisine_2    240758
dtype: int64

Check for rows where `cuisine_2` column contains a comma(more than one cusine)

In [123]:
rows_with_commas = menu_df_cleaned[menu_df_cleaned['cuisine_2'].str.contains(',', na=False)]
print("Rows with commas in 'cuisine_2':")
print(rows_with_commas)

Rows with commas in 'cuisine_2':
Empty DataFrame
Columns: [id, menu_id, r_id, f_id, price, cuisine_1, cuisine_2]
Index: []

In [127]:
menu_df_cleaned.head()

   id menu_id    r_id      f_id price  cuisine_1 cuisine_2
0   0     mn0  567335       fd0  40.0  Beverages    Pizzas
1   1     mn0  567335  fd669322  40.0  Beverages    Pizzas
2   2   mn328  158203       fd0  65.0  Beverages      None
3   3   mn328  158203  fd669322  65.0  Beverages      None
4   4   mn449  158203       fd0  65.0  Beverages      None

In [125]:
menu_df_cleaned.to_csv('cleaned_menu_df.csv', index=False)

In [53]:
orders_df.head()

   Unnamed: 0  order_date  sales_qty  sales_amount currency  user_id      r_id
0           0  2017-10-10        100         41241      INR    49226  567335.0
1           1  2018-05-08          3            -1      INR    77359  531342.0
2           2  2018-04-06          1           875      INR     5321  158203.0
3           3  2018-04-11          1           583      INR    21343  187912.0
4           4  2018-06-18          6          7176      INR    75378  543530.0

In [54]:
orders_df.isnull().sum()

Unnamed: 0         0
order_date         0
sales_qty          0
sales_amount       0
currency           0
user_id            0
r_id            1617
dtype: int64

In [55]:
orders_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150281 entries, 0 to 150280
Data columns (total 7 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   Unnamed: 0    150281 non-null  int64
 1   order_date    150281 non-null  object
 2   sales_qty     150281 non-null  int64
 3   sales_amount  150281 non-null  int64
 4   currency      150281 non-null  object
 5   user_id       150281 non-null  int64
 6   r_id          148664 non-null  float64
dtypes: float64(1), int64(4), object(2)
memory usage: 8.0+ MB

Convert `order_date` to datetime

In [56]:
orders_df['order_date'] = pd.to_datetime(orders_df['order_date'], errors='coerce')

In [57]:
orders_df

,Unnamed: 0,order_date,sales_qty,sales_amount,currency,user_id,r_id
0,0,2017-10-10,100,41241,INR,49226,567335.0
1,1,2018-05-08,3,-1,INR,77359,531342.0
2,2,2018-04-06,1,875,INR,5321,158203.0
3,3,2018-04-11,1,583,INR,21343,187912.0
4,4,2018-06-18,6,7176,INR,75378,543530.0
...,...,...,...,...,...,...,...
150276,150276,2019-04-18,1,394,INR\r,79856,NaN
150277,150277,2019-04-23,1,667,INR\r,65798,NaN
150278,150278,2019-04-23,1,625,INR\r,49176,NaN
150279,150279,2019-04-24,7,8625,INR\r,87924,NaN
150280,150280,2019-04-24,3,3792,INR\r,41474,NaN

In [58]:
# Filter out rows where 'sales_qty' or 'sales_amount' have negative values
cleaned_orders_df = orders_df[(orders_df['sales_qty'] >= 0) & (orders_df['sales_amount'] >= 0)]
cleaned_orders_df.rename(columns={"Unnamed: 0": "order_id"}, inplace=True)

/var/folders/8h/hbj9kb412sz4vmszf826vrrc0000gn/T/ipykernel_59379/3335402645.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  cleaned_orders_df.rename(columns={"Unnamed: 0": "order_id"}, inplace=True)

In [59]:
# Drop rows where 'r_id' column has NaN values
cleaned_orders_df = cleaned_orders_df.dropna(subset=['r_id'])

# Change the data type of 'r_id' column to int
cleaned_orders_df['r_id'] = cleaned_orders_df['r_id'].astype(int)

In [60]:
cleaned_orders_df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 148662 entries, 0 to 148663
Data columns (total 7 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   order_id      148662 non-null  int64
 1   order_date    148662 non-null  datetime64[ns]
 2   sales_qty     148662 non-null  int64
 3   sales_amount  148662 non-null  int64
 4   currency      148662 non-null  object
 5   user_id       148662 non-null  int64
 6   r_id          148662 non-null  int64
dtypes: datetime64[ns](1), int64(5), object(1)
memory usage: 9.1+ MB

In [134]:
cleaned_orders_df

        order_id order_date  sales_qty  sales_amount currency  user_id    r_id
0              0 2017-10-10        100         41241      INR    49226  567335
2              2 2018-04-06          1           875      INR     5321  158203
3              3 2018-04-11          1           583      INR    21343  187912
4              4 2018-06-18          6          7176      INR    75378  543530
5              5 2017-11-20         59           500      USD    34323  158204
...          ...        ...        ...           ...      ...      ...     ...
148659    148659 2019-03-15          1          1630    INR\r    25901  390478
148660    148660 2019-03-15          1          2611    INR\r    97820  103649
148661    148661 2019-03-15          7         10458    INR\r     6041  430451
148662    148662 2019-03-18          1           713    INR\r    81310  518548
148663    148663 2019-03-18          1          1741    INR\r      944  518819

[148662 rows x 7 columns]

In [135]:
cleaned_orders_df['currency'] = cleaned_orders_df['currency'].str.strip()  # Remove leading and trailing whitespace, including carriage returns

In [136]:
cleaned_orders_df

        order_id order_date  sales_qty  sales_amount currency  user_id    r_id
0              0 2017-10-10        100         41241      INR    49226  567335
2              2 2018-04-06          1           875      INR     5321  158203
3              3 2018-04-11          1           583      INR    21343  187912
4              4 2018-06-18          6          7176      INR    75378  543530
5              5 2017-11-20         59           500      USD    34323  158204
...          ...        ...        ...           ...      ...      ...     ...
148659    148659 2019-03-15          1          1630      INR    25901  390478
148660    148660 2019-03-15          1          2611      INR    97820  103649
148661    148661 2019-03-15          7         10458      INR     6041  430451
148662    148662 2019-03-18          1           713      INR    81310  518548
148663    148663 2019-03-18          1          1741      INR      944  518819

[148662 rows x 7 columns]

In [137]:
cleaned_orders_df.to_csv('cleaned_orders_df.csv', index=False)

In [63]:
users_df.isnull().sum()

Unnamed: 0                    0
user_id                       0
name                          0
email                         0
password                      0
Age                           0
Gender                        0
Marital Status                0
Occupation                    0
Monthly Income                0
Educational Qualifications    0
Family size                   0
dtype: int64

In [64]:
users_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100000 entries, 0 to 99999
Data columns (total 12 columns):
 #   Column                      Non-Null Count   Dtype
---  ------                      --------------   -----
 0   Unnamed: 0                  100000 non-null  int64
 1   user_id                     100000 non-null  int64
 2   name                        100000 non-null  object
 3   email                       100000 non-null  object
 4   password                    100000 non-null  object
 5   Age                         100000 non-null  int64
 6   Gender                      100000 non-null  object
 7   Marital Status              100000 non-null  object
 8   Occupation                  100000 non-null  object
 9   Monthly Income              100000 non-null  object
 10  Educational Qualifications  100000 non-null  object
 11  Family size                 100000 non-null  int64
dtypes: int64(4), object(8)
memory usage: 9.2+ MB

In [65]:
users_df_updated = users_df.drop(['Unnamed: 0','email','password'], axis=1)

In [66]:
users_df_updated['Family size'].unique()

array([4, 3, 6, 2, 5, 1])

In [67]:
users_df_updated.to_csv('cleaned_users_df.csv', index=False)

In [68]:
users_df_updated.head()

,user_id,name,Age,Gender,Marital Status,Occupation,Monthly Income,Educational Qualifications,Family size
0,1,Claire Ferguson,20,Female,Single,Student,No Income,Post Graduate,4
1,2,Jennifer Young,24,Female,Single,Student,Below Rs.10000,Graduate,3
2,3,Jermaine Roberson,22,Male,Single,Student,Below Rs.10000,Post Graduate,3
3,4,Rachel Carpenter,22,Female,Single,Student,No Income,Graduate,6
4,5,Shawn Parker,22,Male,Single,Student,Below Rs.10000,Post Graduate,4